# Taps

tap 'buo/cask-upgrade'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'homebrew/cask-fonts'
tap 'shivammathur/php'

# Stuff to install

brew 'z'
brew 'zsh'

brew 'aria2'        # better weget
brew 'bat'          # better cat
brew 'ctop'         # docker top
brew 'eza'          # better ls
brew 'fpp'
brew 'htop'         # better top
brew 'iftop'        # network top
brew 'rsync'
brew 'tldr'         # nice helppages (human readable man pages)
brew 'tmux'
brew 'tokei'        # better cloc
brew 'vim'
brew 'watchexec'    # Run command on filechanges
brew 'wget'         # wget ¯\_(ツ)_/¯
brew 'zoxide'       # replace for cd just nicer

# development brew

brew 'git'

## Node
# brew 'node' using nvm now
brew 'pnpm'
brew 'yarn'

## PHP

brew 'brew-php-switcher'
brew 'composer'
brew 'php'
brew 'php@8.0'
brew 'php@8.1'
brew 'php@8.2'

# default apps

cask 'aldente'
cask 'alfred'
cask 'audacity'
cask 'brave-browser'
cask 'bitwarden'
cask 'coconutbattery'
cask 'cyberduck'
cask 'discord'
cask 'figma'
cask 'firefox'
cask 'iterm2'
cask 'keepassxc'
cask 'keka'
cask 'microsoft-teams'
cask 'numi'
cask 'royal-tsx'
cask 'slack'
cask 'spotify'
cask 'synology-drive'
cask 'teamspeak-client'
cask 'vlc'
cask 'yubico-yubikey-manager'

# development casks

cask 'bruno'
cask 'docker'
cask 'figma'
cask 'fork'
cask 'phpstorm'
cask 'sublime-text'
cask 'tableplus'
cask 'visual-studio-code'

# others

cask 'mactex'

# cask fonts

cask 'font-hack'
cask 'font-input'
cask 'font-inter'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-cascadia-mono'
cask 'font-jetbrains-mono'

# appstore

mas 'BetterSnapTool', id: 417375580
mas 'GoodNotes 6', id: 1444383602
