# Taps

tap 'buo/cask-upgrade'
tap 'shivammathur/php'
tap 'shivammathur/extensions'

# Stuff to install

brew 'z'
brew 'zsh'

# all the tops

brew 'btop'         # better top
brew 'ctop'         # docker top
brew 'iftop'        # network top

brew 'aria2'        # better weget
brew 'bat'          # better cat
brew 'eza'          # better ls
brew 'fpp'
brew 'just'         # better make
brew 'rsync'
brew 'tlrc'         # nice helppages (human readable man pages)
brew 'tmux'
brew 'neovim'
brew 'watchexec'    # Run command on filechanges
brew 'wget'         # wget

# development brew

brew 'git'
brew 'pnpm'
brew 'yarn'

## PHP
brew 'brew-php-switcher'
brew 'composer'
brew 'php@8.3'
brew 'php@8.4'
brew 'php@8.5'
brew 'xdebug@8.3'
brew 'xdebug@8.4'
brew 'xdebug@8.5'

## Casks

# default apps

cask 'aldente'
cask 'alfred'
cask 'audacity'
cask 'brave-browser'
cask 'bitwarden'
cask 'coconutbattery'
cask 'cyberduck'
cask 'discord'
cask 'firefox'
cask 'iterm2'
cask 'keepassxc'
cask 'keka'
cask 'numi'
cask 'royal-tsx'
cask 'slack'
cask 'spotify'
cask 'synology-drive'
cask 'teamspeak-client'
cask 'vlc'
cask 'yubico-authenticator'

# development casks

cask 'bruno'
cask 'docker'
cask 'figma'
cask 'fork'
cask 'heynote'
cask 'phpstorm'
cask 'sublime-text'
cask 'tableplus'
cask 'visual-studio-code'
cask 'mactex'

cask 'claude-code'
cask 'copilot-cli'

# cask fonts

cask 'font-hack'
cask 'font-input'
cask 'font-inter'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-cascadia-mono'
cask 'font-jetbrains-mono'

# appstore

mas 'BetterSnapTool', id: 417375580
mas 'GoodNotes 6', id: 1444383602
