# ─── Taps ─────────────────────────────────────────────────────────────────────

tap "buo/cask-upgrade"         # brew cu — upgrade all casks
tap "shivammathur/php"         # PHP versions
tap "shivammathur/extensions"  # PHP extensions (xdebug etc.)
tap "anomalyco/tap"            # opencode

# ─── CLI ──────────────────────────────────────────────────────────────────────

brew "zsh"                     # Z shell
brew "git"                     # Version control
brew "wget"                    # File downloader
brew "rsync"                   # File sync / transfer
brew "tmux"                    # Terminal multiplexer
brew "neovim"                  # Modern Vim fork
brew "watchexec"               # Re-run commands on file changes

# Better defaults
brew "aria2"                   # Multi-protocol download utility (better wget)
brew "bat"                     # Syntax-highlighted file viewer (better cat)
brew "eza"                     # Modern file lister (better ls)
brew "fpp"                     # PathPicker — interactively select paths from output
brew "just"                    # Command runner (better make)
brew "tlrc"                    # Simplified, community-driven man pages
brew "z"                       # Jump to frecent directories

# System monitoring
brew "btop"                    # Resource monitor (better top)
brew "ctop"                    # Container resource monitor
brew "iftop"                   # Network bandwidth monitor

# ─── Development ──────────────────────────────────────────────────────────────

brew "pnpm"                    # Fast, disk-efficient Node package manager
brew "yarn"                    # (crappy and old)Node package manager

## PHP
brew "brew-php-switcher"       # Quickly switch between PHP versions
brew "composer"
brew "php@8.3"
brew "php@8.4"
brew "php@8.5"
brew "xdebug@8.3"              # PHP debugger / profiler
brew "xdebug@8.4"
brew "xdebug@8.5"

# ─── Apps ─────────────────────────────────────────────────────────────────────

## Productivity
cask "alfred"                  # Spotlight replacement & automation
cask "bitwarden"               # Password manager
cask "coconutbattery"          # Battery health monitor
cask "keepassxc"               # Offline password manager
cask "keka"                    # File archiver
cask "numi"                    # Calculator with natural language input
cask "royal-tsx"               # Remote connection manager (SSH/RDP/VNC)
cask "synology-drive"          # Synology NAS sync client
cask "obsidian"                # Knowledge base & note-taking app

## Communication
cask "discord"                 # Voice & text chat
cask "slack"                   # Team messaging
cask "teamspeak-client"        # Voice communication client

## Media
cask "audacity"                # Audio editor
cask "spotify"                 # Music streaming
cask "vlc"                     # Media player

## Browsers
cask "brave-browser"
cask "firefox"

## Utilities
cask "cyberduck"               # FTP / cloud storage browser
cask "iterm2"                  # Terminal emulator
cask "yubico-authenticator"    # YubiKey OTP & FIDO management

# ─── Development Apps ─────────────────────────────────────────────────────────

cask "bruno"                   # API client (offline, open-source Postman alternative)
cask "docker"                  # Container platform
cask "figma"                   # Collaborative UI design tool
cask "fork"                    # Git GUI client
cask "heynote"                 # Persistent scratchpad for developers
cask "mactex"                  # LaTeX distribution for macOS
cask "phpstorm"                # PHP IDE
cask "sublime-text"            # Lightweight text editor
cask "tableplus"               # Database GUI (MySQL, Postgres, SQLite, …)
cask "visual-studio-code"      # Code editor

# ─── AI ───────────────────────────────────────────────────────────────────────

cask "claude-code"             # Claude AI coding assistant
brew "opencode"                # Open-source AI coding assistant (terminal)
cask "copilot-cli"             # GitHub Copilot in the terminal

# ─── Fonts ────────────────────────────────────────────────────────────────────

cask "font-cascadia-mono"      # Microsoft monospace font
cask "font-hack-nerd-font"     # Hack patched with Nerd Fonts glyphs
cask "font-hack"               # Monospace font designed for source code
cask "font-input"              # Customizable coding font family
cask "font-inter"              # UI font for screens
cask "font-jetbrains-mono"     # Monospace font by JetBrains
cask "font-lato"               # Humanist sans-serif
cask "font-open-sans"          # Humanist sans-serif by Google
cask "font-source-code-pro-for-powerline" # Source Code Pro with Powerline glyphs
cask "font-source-code-pro"            # Monospace font by Adobe
cask "font-source-sans-pro"    # Sans-serif font by Adobe
cask "font-source-serif-pro"   # Serif font by Adobe

# ─── Mac App Store ────────────────────────────────────────────────────────────

mas "BetterSnapTool", id: 417375580  # Window snapping & management
mas "GoodNotes 6",   id: 1444383602 # Handwritten notes & PDF annotation

