alefragnani.project-manager
antfu.i18n-ally
bmewburn.vscode-intelephense-client
christian-kohler.npm-intellisense
CoenraadS.bracket-pair-colorizer
dariofuzinato.vue-peek
dbaeumer.vscode-eslint
dracula-theme.theme-dracula
eamodio.gitlens
EditorConfig.EditorConfig
eg2.vscode-npm-script
ikappas.phpcs
mikestead.dotenv
ms-azuretools.vscode-docker
ms-vscode-remote.remote-wsl
neilbrayfield.php-docblocker
octref.vetur
sdras.vue-vscode-snippets
sibiraj-s.vscode-scss-formatter
vscode-icons-team.vscode-icons
wayou.vscode-todo-highlight
william-voyek.vscode-nginx
xabikos.JavaScriptSnippets
zhuangtongfa.material-theme
